Revit 2026 API

# ExternalResourceSubFolderIconPath Property

---

The path of the resource icon.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string IconPath { get; set; }
```
```vb
Public Property IconPath As String
	Get
	Set
```
```cpp
public:
property String^ IconPath {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member IconPath : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

ExternalResourceSubFolder Class

Autodesk.Revit.DB Namespace